jmeter-course-selection-concurrent-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="并发选课测试">
      <stringProp name="TestPlan.comments">10学生抢3名额-无CSV</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="token1" elementType="Argument">
            <stringProp name="Argument.name">token1</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxNCIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE0LCJpYXQiOjE3NzY4MDcyMTR9.MxIF3NRELnszhcArLvQyulLkozfxgRDfHugF5TtOepI</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token2" elementType="Argument">
            <stringProp name="Argument.name">token2</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxNSIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE1LCJpYXQiOjE3NzY4MDcyMTR9.mg7ZP3t9Pgye1m41Sh4gMiGu_NypMcXUMfvMqfeLr04</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token3" elementType="Argument">
            <stringProp name="Argument.name">token3</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxNiIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE2LCJpYXQiOjE3NzY4MDcyMTR9.ZaUZtChacNiGzakIZlWEA36ZdXkMwgj_MvDWA3yIe9M</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token4" elementType="Argument">
            <stringProp name="Argument.name">token4</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxNyIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE3LCJpYXQiOjE3NzY4MDcyMTR9.kIeh6kYdD224dsZYYNyTEfFrpTbRCKgaCfpQIybfBok</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token5" elementType="Argument">
            <stringProp name="Argument.name">token5</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxOCIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE4LCJpYXQiOjE3NzY4MDcyMTR9._pVfSPbmMlYjux_HSXu1PW0DM78ncm6zJQJAUX5Sj7M</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token6" elementType="Argument">
            <stringProp name="Argument.name">token6</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxOSIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjE5LCJpYXQiOjE3NzY4MDcyMTR9.ZnNa6CBce6kbnKbm4nzIeyI4jLncRkvwPLp6lM0MJCA</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token7" elementType="Argument">
            <stringProp name="Argument.name">token7</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIyMCIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjIwLCJpYXQiOjE3NzY4MDcyMTR9.DK8_dpbbwy4LKk0vbp7Qe378OjuD5XqIXuEPRRolB1E</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token8" elementType="Argument">
            <stringProp name="Argument.name">token8</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIyMSIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjIxLCJpYXQiOjE3NzY4MDcyMTR9.6bqIS5fGt8J0vLq8hZHtO8bpvU9bcZu-uzYv9utOCRs</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token9" elementType="Argument">
            <stringProp name="Argument.name">token9</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIyMiIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjIyLCJpYXQiOjE3NzY4MDcyMTR9.aOGCuAwNhu6q2LMQ-wJf-_n8NbN51lDZbAVCDPtL1nI</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token10" elementType="Argument">
            <stringProp name="Argument.name">token10</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIyMyIsInJvbGUiOiJzdHVkZW50IiwiZXhwIjoxNzc2ODkzNjE0LCJ1c2VySWQiOjIzLCJpYXQiOjE3NzY4MDcyMTR9.NQlgFVWDxgvQt5Vjp327A_5tmDU51-PgiKB93Dzdz7k</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10个学生并发">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="设置Token">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def idx = ctx.getThreadNum() + 1
vars.put(&quot;myToken&quot;, vars.get(&quot;token&quot; + idx))</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="选课请求">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/course-selection/select/15</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${myToken}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="检查响应码" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">HTTP状态码不是200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="汇总报告">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>